Revit 2027 API
BuiltInFailures.ScheduleViewFailures.BadViewType Property
 Schedules can only be placed on Sheets.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BadViewType { get; }
Public Shared ReadOnly Property BadViewType As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BadViewType {
	FailureDefinitionId^ get ();
}
static member BadViewType : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ScheduleViewFailures Class
Autodesk.Revit.DB Namespace